service-email-egress/egress-balancer/ews_find_expired.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2016" />
    <t:ExchangeImpersonation>
      <t:ConnectingSID><t:PrimarySmtpAddress>peter@woodfinegroup.com</t:PrimarySmtpAddress></t:ConnectingSID>
    </t:ExchangeImpersonation>
  </soap:Header>
  <soap:Body>
    <m:FindItem Traversal="Shallow">
      <m:ItemShape>
        <t:BaseShape>Default</t:BaseShape>
      </m:ItemShape>
      <m:IndexedPageItemView MaxEntriesReturned="100" Offset="300" BasePoint="Beginning" />
      <m:Restriction>
        <t:IsLessThan>
          <t:FieldURI FieldURI="item:DateTimeReceived" />
          <t:FieldURIOrConstant>
            <t:Constant Value="2025-05-21T17:40:52Z" />
          </t:FieldURIOrConstant>
        </t:IsLessThan>
      </m:Restriction>
      <m:ParentFolderIds>
        <t:FolderId Id="AAMkADVkZGE2MTEzLWFiMGEtNGZiMS1iNjU5LWI2ZjgxNjI3OGYwMwAuAAAAAADwv6aPuXUhRZGdC5GlOwN1AQD4ZMQx5VnyS6YsK9NKxalrAAAAAAEJAAA=" />
      </m:ParentFolderIds>
    </m:FindItem>
  </soap:Body>
</soap:Envelope>
